fonecmid-diplom/src/InformationRegisters/ВКМ_РеализацияДоговор/ВКМ_РеализацияДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_РеализацияДоговор</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ОбслуживаниеКлиентов/Module.bsl
Функция ТяжелаяОперация(Параметры) Экспорт
	
	ТекДок = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_РеализацияДоговор.Реализация КАК Реализация,
		|	ВКМ_РеализацияДоговор.Договор КАК Договор,
		|	ВКМ_РеализацияДоговор.Договор.Организация КАК Организация,
		|	ВКМ_РеализацияДоговор.Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_РеализацияДоговор.Договор.ВКМ_АбонентскаяПлата КАК АбонентскаяПлата,
		|	ВКМ_РеализацияДоговор.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_РеализацияДоговор.Договор.Владелец КАК Владелец,
		|	ВКМ_РеализацияДоговор.Договор.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ВКМ_РеализацияДоговор.Договор.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
		|	ЗаказПокупателя.Ссылка КАК ЗаказПокупателяСсылка
		|ИЗ
		|	РегистрСведений.ВКМ_РеализацияДоговор КАК ВКМ_РеализацияДоговор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ВКМ_РеализацияДоговор.Договор.Владелец = ЗаказПокупателя.Контрагент
		|			И ВКМ_РеализацияДоговор.Договор.Ссылка = ЗаказПокупателя.Договор.Ссылка
		|			И ВКМ_РеализацияДоговор.Договор.Организация = ЗаказПокупателя.Организация
		|ГДЕ
		|	ВКМ_РеализацияДоговор.Период >= &ДатаНачала
		|	И ВКМ_РеализацияДоговор.Период <= &ДатаОкончания";
	
	ДатаНачала = Параметры.Период.ДатаНачала;
	ДатаОкончания = Параметры.Период.ДатаОкончания;
	Если ДатаНачала = Дата(1, 1, 1) И ДатаОкончания = Дата(1, 1, 1) Тогда
		ДатаОкончания = Дата(3999, 12, 31);
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
	
	Выборка = Запрос.Выполнить().Выбрать();

	ВсегоДокументов = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда
			
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Дата = ТекущаяДата();
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Владелец;
			ДокументРеализация.Ответственный = Пользователи.ТекущийПользователь();
			ДокументРеализация.Основание = Выборка.ЗаказПокупателяСсылка;
			
			ВКМ_ВыполнитьАвтозаполнение(ДокументРеализация, Выборка.Договор);
			
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
		КонецЕсли;
	
		ПроцентВыполнения = (ТекДок / ВсегоДокументов) * 100;
		ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(Выборка.Договор));
		
		ТекДок = ТекДок + 1;
				
	КонецЦикла;
	
КонецФункции

Процедура ВКМ_ВыполнитьАвтозаполнение(ДокументРеализация, Договор) Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НоменклатураАбонентскаяПлата.Код = "" Или НоменклатураРаботыСпециалиста.Код = "" Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнены константы НоменклатураАбонентскаяПлата или НоменклатураРаботаСпециалиста";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;

	ДокументРеализация.Товары.Очистить();
	ДокументРеализация.Услуги.Очистить();	
	
	СуммаДокумента = 0;
	
	Если Договор.ВКМ_АбонентскаяПлата <> 0 Тогда
		
		НоваяУслуга = ДокументРеализация.Услуги.Добавить();
		
		НоваяУслуга.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		НоваяУслуга.Количество = 1;
		НоваяУслуга.Цена = Договор.ВКМ_АбонентскаяПлата;
		НоваяУслуга.Сумма = Договор.ВКМ_АбонентскаяПлата;
		
		СуммаДокумента = НоваяУслуга.Сумма;
		
	КонецЕсли;

	ДокументРеализация.Записать();	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0)) КАК КоличествоЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0)) КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|ГДЕ
		|	ВКМ_ВыполненныеКлиентуРаботы.Клиент = &Контрагент
		|	И ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
		|	И МЕСЯЦ(ВКМ_ВыполненныеКлиентуРаботы.Период) = МЕСЯЦ(&Период)
		|	И ГОД(ВКМ_ВыполненныеКлиентуРаботы.Период) = ГОД(&Период)";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", ДокументРеализация.Контрагент);
	Запрос.УстановитьПараметр("Период", ДокументРеализация.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.КоличествоЧасов) Или Не ЗначениеЗаполнено(Выборка.СуммаКОплате) Тогда
			
			Продолжить;
			
		КонецЕсли;

		НоваяУслуга = ДокументРеализация.Услуги.Добавить();
		
		НоваяУслуга.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		НоваяУслуга.Количество = Выборка.КоличествоЧасов;
		НоваяУслуга.Цена = ?(Выборка.КоличествоЧасов = 0, 0, Выборка.СуммаКОплате / Выборка.КоличествоЧасов);
		НоваяУслуга.Сумма = Выборка.СуммаКОплате;

		СуммаДокумента = СуммаДокумента + НоваяУслуга.Сумма;
				
	КонецЦикла;
	
	ДокументРеализация.Комментарий = СтрШаблон("Автоматическое создание акта за %1 по договору %2",
			Формат(ДокументРеализация.Дата, "ДФ='MMMM yyyy ''г.'''"), Договор);

	ДокументРеализация.Записать();	
	
	МенеджерЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = НачалоМесяца(ДокументРеализация.Дата);
	МенеджерЗаписи.Договор = Договор;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		МенеджерЗаписи.Реализация = ДокументРеализация.Ссылка;

	Иначе

		МенеджерЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Период = НачалоМесяца(ДокументРеализация.Дата);
		МенеджерЗаписи.Договор = Договор;

		МенеджерЗаписи.Реализация = ДокументРеализация.Ссылка;
		
	КонецЕсли;

	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

Функция НомерМесяца(НаименованиеМесяца) Экспорт
	
	Если НРег(НаименованиеМесяца) = "январь" Тогда Номер = 1;
	ИначеЕсли НРег(НаименованиеМесяца) = "февраль" Тогда Номер = 2;
	ИначеЕсли НРег(НаименованиеМесяца) = "март" Тогда Номер = 3;
	ИначеЕсли НРег(НаименованиеМесяца) = "апрель" Тогда Номер = 4;
	ИначеЕсли НРег(НаименованиеМесяца) = "май" Тогда Номер = 5;
	ИначеЕсли НРег(НаименованиеМесяца) = "июнь" Тогда Номер = 6;
	ИначеЕсли НРег(НаименованиеМесяца) = "июль" Тогда Номер = 7;
	ИначеЕсли НРег(НаименованиеМесяца) = "август" Тогда Номер = 8;
	ИначеЕсли НРег(НаименованиеМесяца) = "сентябрь" Тогда Номер = 9;
	ИначеЕсли НРег(НаименованиеМесяца) = "октябрь" Тогда Номер = 10;
	ИначеЕсли НРег(НаименованиеМесяца) = "ноябрь" Тогда Номер = 11;
	ИначеЕсли НРег(НаименованиеМесяца) = "декабрь" Тогда Номер = 12;
	КонецЕсли;
	
	Возврат Номер;

КонецФункции
